---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBarType.StandardBendDiameter
source: html/2ec8bbcf-f2e6-9511-ab34-1cdea8910ef2.htm
---
# Autodesk.Revit.DB.Structure.RebarBarType.StandardBendDiameter Property

Defines bar bend diameter for rebar whose style is standard

## Syntax (C#)
```csharp
public double StandardBendDiameter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: the bend diameter standardBendDiam isn't between bar diameter and 99.0